Repository: lcd11001/flutter-quiz
Catalog: lib/l10n/*.arb
Languages: vi

source: Hello World!
vi: Xin chào

# app_title
source: Simple Quiz
vi: Ai Là Triệu Phú

# btn_start
source: Start
vi: Bắt đầu

# summary
source: You have answered {correctAnswers} out of {totalQuestions} questions correctly!
vi: Bạn đã trả lời đúng {correctAnswers} câu hỏi trong tổng số {totalQuestions} câu hỏi!

# btn_reset
source: Reset Quiz
vi: Chơi lại

# txt_question
source: Question {id}
vi: Câu hỏi {id}

# txt_correct_answer
source: Correct Answer: {answer}
vi: Câu trả lời đúng: {answer}

# txt_user_answer
source: Your Answer: {answer}
vi: Câu trả lời của bạn: {answer}

# question1
source: What are the main building blocks of Flutter UIs?
vi: Câu hỏi 1: Ai là người đầu tiên đặt chân lên Mặt Trăng?

# answer1_1
source: Widgets
vi: Neil Armstrong

# answer1_2
source: Components
vi: Buzz Aldrin

# answer1_3
source: Blocks
vi: Michael Collins

# answer1_4
source: Functions
vi: Yuri Gagarin

# question2
source: How are Flutter UIs built?
vi: Câu hỏi 2: Trong hệ mặt trời, hành tinh nào gần nhất với Mặt Trời?

# answer2_1
source: By combining widgets in code
vi: Mercury

# answer2_2
source: By combining widgets in a visual editor
vi: Venus

# answer2_3
source: By defining widgets in config files
vi: Earth

# answer2_4
source: By using XCode for iOS and Android Studio for Android
vi: Mars

# question3
source: What's the purpose of a StatefulWidget?
vi: Câu hỏi 3: Ai là người sáng lập Microsoft?

# answer3_1
source: Update UI as data changes
vi: Bill Gates

# answer3_2
source: Update data as UI changes
vi: Steve Jobs

# answer3_3
source: Ignore data changes
vi: Mark Zuckerberg

# answer3_4
source: Render UI that does not depend on data
vi: Elon Musk

# question4
source: Which widget should you try to use more often: StatelessWidget or StatefulWidget?
vi: Câu hỏi 4: Trong lịch sử Việt Nam, ai là người đã đánh bại quân xâm lược Mông Cổ?

# answer4_1
source: StatelessWidget
vi: Trần Hưng Đạo

# answer4_2
source: StatefulWidget
vi: Lê Lợi

# answer4_3
source: Both are equally good
vi: Nguyễn Huệ

# answer4_4
source: None of the above
vi: Quang Trung

# question5
source: What happens if you change data in a StatelessWidget?
vi: Câu hỏi 5: Ai là người phát minh ra đèn điện?

# answer5_1
source: The UI is not updated
vi: Thomas Edison

# answer5_2
source: The UI is updated
vi: Nikola Tesla

# answer5_3
source: The closest StatefulWidget is updated
vi: Alexander Graham Bell

# answer5_4
source: Any nested StatefulWidgets are updated
vi: Albert Einstein

# question6
source: How should you update data inside of StatefulWidgets?
vi: Câu hỏi 6: Trong hệ mặt trời, hành tinh nào có vòng tròn màu sắc xung quanh?

# answer6_1
source: By calling setState()
vi: Saturn

# answer6_2
source: By calling updateData()
vi: Jupiter

# answer6_3
source: By calling updateUI()
vi: Uranus

# answer6_4
source: By calling updateState()
vi: Neptune
